espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/i2s_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

#define REG_I2S_BASE(i)                         (DR_REG_I2S_BASE + (i) * 0x1000)

/** I2S_INT_RAW_REG register
 *  I2S interrupt raw register, valid in level.
 */
#define I2S_INT_RAW_REG(i) (REG_I2S_BASE(i) + 0xc)
/** I2S_RX_DONE_INT_RAW : RO/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt status bit  for the i2s_rx_done_int interrupt
 */
#define I2S_RX_DONE_INT_RAW    (BIT(0))
#define I2S_RX_DONE_INT_RAW_M  (I2S_RX_DONE_INT_RAW_V << I2S_RX_DONE_INT_RAW_S)
#define I2S_RX_DONE_INT_RAW_V  0x00000001U
#define I2S_RX_DONE_INT_RAW_S  0
/** I2S_TX_DONE_INT_RAW : RO/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt status bit  for the i2s_tx_done_int interrupt
 */
#define I2S_TX_DONE_INT_RAW    (BIT(1))
#define I2S_TX_DONE_INT_RAW_M  (I2S_TX_DONE_INT_RAW_V << I2S_TX_DONE_INT_RAW_S)
#define I2S_TX_DONE_INT_RAW_V  0x00000001U
#define I2S_TX_DONE_INT_RAW_S  1
/** I2S_RX_HUNG_INT_RAW : RO/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt status bit  for the i2s_rx_hung_int interrupt
 */
#define I2S_RX_HUNG_INT_RAW    (BIT(2))
#define I2S_RX_HUNG_INT_RAW_M  (I2S_RX_HUNG_INT_RAW_V << I2S_RX_HUNG_INT_RAW_S)
#define I2S_RX_HUNG_INT_RAW_V  0x00000001U
#define I2S_RX_HUNG_INT_RAW_S  2
/** I2S_TX_HUNG_INT_RAW : RO/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt status bit  for the i2s_tx_hung_int interrupt
 */
#define I2S_TX_HUNG_INT_RAW    (BIT(3))
#define I2S_TX_HUNG_INT_RAW_M  (I2S_TX_HUNG_INT_RAW_V << I2S_TX_HUNG_INT_RAW_S)
#define I2S_TX_HUNG_INT_RAW_V  0x00000001U
#define I2S_TX_HUNG_INT_RAW_S  3

/** I2S_INT_ST_REG register
 *  I2S interrupt status register.
 */
#define I2S_INT_ST_REG(i) (REG_I2S_BASE(i) + 0x10)
/** I2S_RX_DONE_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status bit  for the i2s_rx_done_int interrupt
 */
#define I2S_RX_DONE_INT_ST    (BIT(0))
#define I2S_RX_DONE_INT_ST_M  (I2S_RX_DONE_INT_ST_V << I2S_RX_DONE_INT_ST_S)
#define I2S_RX_DONE_INT_ST_V  0x00000001U
#define I2S_RX_DONE_INT_ST_S  0
/** I2S_TX_DONE_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status bit  for the i2s_tx_done_int interrupt
 */
#define I2S_TX_DONE_INT_ST    (BIT(1))
#define I2S_TX_DONE_INT_ST_M  (I2S_TX_DONE_INT_ST_V << I2S_TX_DONE_INT_ST_S)
#define I2S_TX_DONE_INT_ST_V  0x00000001U
#define I2S_TX_DONE_INT_ST_S  1
/** I2S_RX_HUNG_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status bit  for the i2s_rx_hung_int interrupt
 */
#define I2S_RX_HUNG_INT_ST    (BIT(2))
#define I2S_RX_HUNG_INT_ST_M  (I2S_RX_HUNG_INT_ST_V << I2S_RX_HUNG_INT_ST_S)
#define I2S_RX_HUNG_INT_ST_V  0x00000001U
#define I2S_RX_HUNG_INT_ST_S  2
/** I2S_TX_HUNG_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status bit  for the i2s_tx_hung_int interrupt
 */
#define I2S_TX_HUNG_INT_ST    (BIT(3))
#define I2S_TX_HUNG_INT_ST_M  (I2S_TX_HUNG_INT_ST_V << I2S_TX_HUNG_INT_ST_S)
#define I2S_TX_HUNG_INT_ST_V  0x00000001U
#define I2S_TX_HUNG_INT_ST_S  3

/** I2S_INT_ENA_REG register
 *  I2S interrupt enable register.
 */
#define I2S_INT_ENA_REG(i) (REG_I2S_BASE(i) + 0x14)
/** I2S_RX_DONE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit  for the i2s_rx_done_int interrupt
 */
#define I2S_RX_DONE_INT_ENA    (BIT(0))
#define I2S_RX_DONE_INT_ENA_M  (I2S_RX_DONE_INT_ENA_V << I2S_RX_DONE_INT_ENA_S)
#define I2S_RX_DONE_INT_ENA_V  0x00000001U
#define I2S_RX_DONE_INT_ENA_S  0
/** I2S_TX_DONE_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit  for the i2s_tx_done_int interrupt
 */
#define I2S_TX_DONE_INT_ENA    (BIT(1))
#define I2S_TX_DONE_INT_ENA_M  (I2S_TX_DONE_INT_ENA_V << I2S_TX_DONE_INT_ENA_S)
#define I2S_TX_DONE_INT_ENA_V  0x00000001U
#define I2S_TX_DONE_INT_ENA_S  1
/** I2S_RX_HUNG_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit  for the i2s_rx_hung_int interrupt
 */
#define I2S_RX_HUNG_INT_ENA    (BIT(2))
#define I2S_RX_HUNG_INT_ENA_M  (I2S_RX_HUNG_INT_ENA_V << I2S_RX_HUNG_INT_ENA_S)
#define I2S_RX_HUNG_INT_ENA_V  0x00000001U
#define I2S_RX_HUNG_INT_ENA_S  2
/** I2S_TX_HUNG_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit  for the i2s_tx_hung_int interrupt
 */
#define I2S_TX_HUNG_INT_ENA    (BIT(3))
#define I2S_TX_HUNG_INT_ENA_M  (I2S_TX_HUNG_INT_ENA_V << I2S_TX_HUNG_INT_ENA_S)
#define I2S_TX_HUNG_INT_ENA_V  0x00000001U
#define I2S_TX_HUNG_INT_ENA_S  3

/** I2S_INT_CLR_REG register
 *  I2S interrupt clear register.
 */
#define I2S_INT_CLR_REG(i) (REG_I2S_BASE(i) + 0x18)
/** I2S_RX_DONE_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the i2s_rx_done_int interrupt
 */
#define I2S_RX_DONE_INT_CLR    (BIT(0))
#define I2S_RX_DONE_INT_CLR_M  (I2S_RX_DONE_INT_CLR_V << I2S_RX_DONE_INT_CLR_S)
#define I2S_RX_DONE_INT_CLR_V  0x00000001U
#define I2S_RX_DONE_INT_CLR_S  0
/** I2S_TX_DONE_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the i2s_tx_done_int interrupt
 */
#define I2S_TX_DONE_INT_CLR    (BIT(1))
#define I2S_TX_DONE_INT_CLR_M  (I2S_TX_DONE_INT_CLR_V << I2S_TX_DONE_INT_CLR_S)
#define I2S_TX_DONE_INT_CLR_V  0x00000001U
#define I2S_TX_DONE_INT_CLR_S  1
/** I2S_RX_HUNG_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the i2s_rx_hung_int interrupt
 */
#define I2S_RX_HUNG_INT_CLR    (BIT(2))
#define I2S_RX_HUNG_INT_CLR_M  (I2S_RX_HUNG_INT_CLR_V << I2S_RX_HUNG_INT_CLR_S)
#define I2S_RX_HUNG_INT_CLR_V  0x00000001U
#define I2S_RX_HUNG_INT_CLR_S  2
/** I2S_TX_HUNG_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the i2s_tx_hung_int interrupt
 */
#define I2S_TX_HUNG_INT_CLR    (BIT(3))
#define I2S_TX_HUNG_INT_CLR_M  (I2S_TX_HUNG_INT_CLR_V << I2S_TX_HUNG_INT_CLR_S)
#define I2S_TX_HUNG_INT_CLR_V  0x00000001U
#define I2S_TX_HUNG_INT_CLR_S  3

/** I2S_RX_CONF_REG register
 *  I2S RX configure register
 */
#define I2S_RX_CONF_REG(i) (REG_I2S_BASE(i) + 0x20)
/** I2S_RX_RESET : WT; bitpos: [0]; default: 0;
 *  Set this bit to reset receiver
 */
#define I2S_RX_RESET    (BIT(0))
#define I2S_RX_RESET_M  (I2S_RX_RESET_V << I2S_RX_RESET_S)
#define I2S_RX_RESET_V  0x00000001U
#define I2S_RX_RESET_S  0
/** I2S_RX_FIFO_RESET : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset Rx AFIFO
 */
#define I2S_RX_FIFO_RESET    (BIT(1))
#define I2S_RX_FIFO_RESET_M  (I2S_RX_FIFO_RESET_V << I2S_RX_FIFO_RESET_S)
#define I2S_RX_FIFO_RESET_V  0x00000001U
#define I2S_RX_FIFO_RESET_S  1
/** I2S_RX_START : R/W/SC; bitpos: [2]; default: 0;
 *  Set this bit to start receiving data
 */
#define I2S_RX_START    (BIT(2))
#define I2S_RX_START_M  (I2S_RX_START_V << I2S_RX_START_S)
#define I2S_RX_START_V  0x00000001U
#define I2S_RX_START_S  2
/** I2S_RX_SLAVE_MOD : R/W; bitpos: [3]; default: 0;
 *  Set this bit to enable slave receiver mode
 */
#define I2S_RX_SLAVE_MOD    (BIT(3))
#define I2S_RX_SLAVE_MOD_M  (I2S_RX_SLAVE_MOD_V << I2S_RX_SLAVE_MOD_S)
#define I2S_RX_SLAVE_MOD_V  0x00000001U
#define I2S_RX_SLAVE_MOD_S  3
/** I2S_RX_STOP_MODE : R/W; bitpos: [5:4]; default: 0;
 *  0  : I2S Rx only stop when reg_rx_start is cleared.   1: Stop when reg_rx_start is
 *  0 or in_suc_eof is 1.   2:  Stop I2S RX when reg_rx_start is 0 or RX FIFO is full.
 */
#define I2S_RX_STOP_MODE    0x00000003U
#define I2S_RX_STOP_MODE_M  (I2S_RX_STOP_MODE_V << I2S_RX_STOP_MODE_S)
#define I2S_RX_STOP_MODE_V  0x00000003U
#define I2S_RX_STOP_MODE_S  4
/** I2S_RX_MONO : R/W; bitpos: [6]; default: 0;
 *  Set this bit to enable receiver  in mono mode
 */
#define I2S_RX_MONO    (BIT(6))
#define I2S_RX_MONO_M  (I2S_RX_MONO_V << I2S_RX_MONO_S)
#define I2S_RX_MONO_V  0x00000001U
#define I2S_RX_MONO_S  6
/** I2S_RX_BIG_ENDIAN : R/W; bitpos: [7]; default: 0;
 *  I2S Rx byte endian, 1: low addr value to high addr. 0: low addr with low addr value.
 */
#define I2S_RX_BIG_ENDIAN    (BIT(7))
#define I2S_RX_BIG_ENDIAN_M  (I2S_RX_BIG_ENDIAN_V << I2S_RX_BIG_ENDIAN_S)
#define I2S_RX_BIG_ENDIAN_V  0x00000001U
#define I2S_RX_BIG_ENDIAN_S  7
/** I2S_RX_UPDATE : R/W/SC; bitpos: [8]; default: 0;
 *  Set 1 to update I2S RX registers from APB clock domain to I2S RX clock domain. This
 *  bit will be cleared by hardware after update register done.
 */
#define I2S_RX_UPDATE    (BIT(8))
#define I2S_RX_UPDATE_M  (I2S_RX_UPDATE_V << I2S_RX_UPDATE_S)
#define I2S_RX_UPDATE_V  0x00000001U
#define I2S_RX_UPDATE_S  8
/** I2S_RX_MONO_FST_VLD : R/W; bitpos: [9]; default: 1;
 *  1: The first channel data value is valid in I2S RX mono mode.   0: The second
 *  channel data value is valid in I2S RX mono mode.
 */
#define I2S_RX_MONO_FST_VLD    (BIT(9))
#define I2S_RX_MONO_FST_VLD_M  (I2S_RX_MONO_FST_VLD_V << I2S_RX_MONO_FST_VLD_S)
#define I2S_RX_MONO_FST_VLD_V  0x00000001U
#define I2S_RX_MONO_FST_VLD_S  9
/** I2S_RX_PCM_CONF : R/W; bitpos: [11:10]; default: 1;
 *  I2S RX compress/decompress configuration bit. & 0 (atol): A-Law decompress, 1
 *  (ltoa) : A-Law compress, 2 (utol) : u-Law decompress, 3 (ltou) : u-Law compress. &
 */
#define I2S_RX_PCM_CONF    0x00000003U
#define I2S_RX_PCM_CONF_M  (I2S_RX_PCM_CONF_V << I2S_RX_PCM_CONF_S)
#define I2S_RX_PCM_CONF_V  0x00000003U
#define I2S_RX_PCM_CONF_S  10
/** I2S_RX_PCM_BYPASS : R/W; bitpos: [12]; default: 1;
 *  Set this bit to bypass Compress/Decompress module for received data.
 */
#define I2S_RX_PCM_BYPASS    (BIT(12))
#define I2S_RX_PCM_BYPASS_M  (I2S_RX_PCM_BYPASS_V << I2S_RX_PCM_BYPASS_S)
#define I2S_RX_PCM_BYPASS_V  0x00000001U
#define I2S_RX_PCM_BYPASS_S  12
/** I2S_RX_MSB_SHIFT : R/W; bitpos: [13]; default: 1;
 *  Set this bit to enable receiver in Phillips standard mode
 */
#define I2S_RX_MSB_SHIFT    (BIT(13))
#define I2S_RX_MSB_SHIFT_M  (I2S_RX_MSB_SHIFT_V << I2S_RX_MSB_SHIFT_S)
#define I2S_RX_MSB_SHIFT_V  0x00000001U
#define I2S_RX_MSB_SHIFT_S  13
/** I2S_RX_LEFT_ALIGN : R/W; bitpos: [15]; default: 1;
 *  1: I2S RX left alignment mode. 0: I2S RX right alignment mode.
 */
#define I2S_RX_LEFT_ALIGN    (BIT(15))
#define I2S_RX_LEFT_ALIGN_M  (I2S_RX_LEFT_ALIGN_V << I2S_RX_LEFT_ALIGN_S)
#define I2S_RX_LEFT_ALIGN_V  0x00000001U
#define I2S_RX_LEFT_ALIGN_S  15
/** I2S_RX_24_FILL_EN : R/W; bitpos: [16]; default: 0;
 *  1: store 24 channel bits to 32 bits. 0:store 24 channel bits to 24 bits.
 */
#define I2S_RX_24_FILL_EN    (BIT(16))
#define I2S_RX_24_FILL_EN_M  (I2S_RX_24_FILL_EN_V << I2S_RX_24_FILL_EN_S)
#define I2S_RX_24_FILL_EN_V  0x00000001U
#define I2S_RX_24_FILL_EN_S  16
/** I2S_RX_WS_IDLE_POL : R/W; bitpos: [17]; default: 0;
 *  0: WS should be 0 when receiving left channel data, and WS is 1in right channel.
 *  1: WS should be 1 when receiving left channel data, and WS is 0in right channel.
 */
#define I2S_RX_WS_IDLE_POL    (BIT(17))
#define I2S_RX_WS_IDLE_POL_M  (I2S_RX_WS_IDLE_POL_V << I2S_RX_WS_IDLE_POL_S)
#define I2S_RX_WS_IDLE_POL_V  0x00000001U
#define I2S_RX_WS_IDLE_POL_S  17
/** I2S_RX_BIT_ORDER : R/W; bitpos: [18]; default: 0;
 *  I2S Rx bit endian. 1:small endian, the LSB is received first. 0:big endian, the MSB
 *  is received first.
 */
#define I2S_RX_BIT_ORDER    (BIT(18))
#define I2S_RX_BIT_ORDER_M  (I2S_RX_BIT_ORDER_V << I2S_RX_BIT_ORDER_S)
#define I2S_RX_BIT_ORDER_V  0x00000001U
#define I2S_RX_BIT_ORDER_S  18
/** I2S_RX_TDM_EN : R/W; bitpos: [19]; default: 0;
 *  1: Enable I2S TDM Rx mode . 0: Disable.
 */
#define I2S_RX_TDM_EN    (BIT(19))
#define I2S_RX_TDM_EN_M  (I2S_RX_TDM_EN_V << I2S_RX_TDM_EN_S)
#define I2S_RX_TDM_EN_V  0x00000001U
#define I2S_RX_TDM_EN_S  19
/** I2S_RX_PDM_EN : R/W; bitpos: [20]; default: 0;
 *  1: Enable I2S PDM Rx mode . 0: Disable.
 */
#define I2S_RX_PDM_EN    (BIT(20))
#define I2S_RX_PDM_EN_M  (I2S_RX_PDM_EN_V << I2S_RX_PDM_EN_S)
#define I2S_RX_PDM_EN_V  0x00000001U
#define I2S_RX_PDM_EN_S  20
/** I2S_RX_BCK_DIV_NUM : R/W; bitpos: [26:21]; default: 6;
 *  Bit clock configuration bits in receiver mode.
 */
#define I2S_RX_BCK_DIV_NUM    0x0000003FU
#define I2S_RX_BCK_DIV_NUM_M  (I2S_RX_BCK_DIV_NUM_V << I2S_RX_BCK_DIV_NUM_S)
#define I2S_RX_BCK_DIV_NUM_V  0x0000003FU
#define I2S_RX_BCK_DIV_NUM_S  21

/** I2S_TX_CONF_REG register
 *  I2S TX configure register
 */
#define I2S_TX_CONF_REG(i) (REG_I2S_BASE(i) + 0x24)
/** I2S_TX_RESET : WT; bitpos: [0]; default: 0;
 *  Set this bit to reset transmitter
 */
#define I2S_TX_RESET    (BIT(0))
#define I2S_TX_RESET_M  (I2S_TX_RESET_V << I2S_TX_RESET_S)
#define I2S_TX_RESET_V  0x00000001U
#define I2S_TX_RESET_S  0
/** I2S_TX_FIFO_RESET : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset Tx AFIFO
 */
#define I2S_TX_FIFO_RESET    (BIT(1))
#define I2S_TX_FIFO_RESET_M  (I2S_TX_FIFO_RESET_V << I2S_TX_FIFO_RESET_S)
#define I2S_TX_FIFO_RESET_V  0x00000001U
#define I2S_TX_FIFO_RESET_S  1
/** I2S_TX_START : R/W/SC; bitpos: [2]; default: 0;
 *  Set this bit to start transmitting data
 */
#define I2S_TX_START    (BIT(2))
#define I2S_TX_START_M  (I2S_TX_START_V << I2S_TX_START_S)
#define I2S_TX_START_V  0x00000001U
#define I2S_TX_START_S  2
/** I2S_TX_SLAVE_MOD : R/W; bitpos: [3]; default: 0;
 *  Set this bit to enable slave transmitter mode
 */
#define I2S_TX_SLAVE_MOD    (BIT(3))
#define I2S_TX_SLAVE_MOD_M  (I2S_TX_SLAVE_MOD_V << I2S_TX_SLAVE_MOD_S)
#define I2S_TX_SLAVE_MOD_V  0x00000001U
#define I2S_TX_SLAVE_MOD_S  3
/** I2S_TX_STOP_EN : R/W; bitpos: [4]; default: 1;
 *  Set this bit to stop disable output BCK signal and WS signal when tx FIFO is empty
 */
#define I2S_TX_STOP_EN    (BIT(4))
#define I2S_TX_STOP_EN_M  (I2S_TX_STOP_EN_V << I2S_TX_STOP_EN_S)
#define I2S_TX_STOP_EN_V  0x00000001U
#define I2S_TX_STOP_EN_S  4
/** I2S_TX_CHAN_EQUAL : R/W; bitpos: [5]; default: 0;
 *  1: The value of Left channel data is equal to the value of right channel data in
 *  I2S TX mono mode or TDM channel select mode. 0: The invalid channel data is
 *  reg_i2s_single_data in I2S TX mono mode or TDM channel select mode.
 */
#define I2S_TX_CHAN_EQUAL    (BIT(5))
#define I2S_TX_CHAN_EQUAL_M  (I2S_TX_CHAN_EQUAL_V << I2S_TX_CHAN_EQUAL_S)
#define I2S_TX_CHAN_EQUAL_V  0x00000001U
#define I2S_TX_CHAN_EQUAL_S  5
/** I2S_TX_MONO : R/W; bitpos: [6]; default: 0;
 *  Set this bit to enable transmitter in mono mode
 */
#define I2S_TX_MONO    (BIT(6))
#define I2S_TX_MONO_M  (I2S_TX_MONO_V << I2S_TX_MONO_S)
#define I2S_TX_MONO_V  0x00000001U
#define I2S_TX_MONO_S  6
/** I2S_TX_BIG_ENDIAN : R/W; bitpos: [7]; default: 0;
 *  I2S Tx byte endian, 1: low addr value to high addr.  0: low addr with low addr
 *  value.
 */
#define I2S_TX_BIG_ENDIAN    (BIT(7))
#define I2S_TX_BIG_ENDIAN_M  (I2S_TX_BIG_ENDIAN_V << I2S_TX_BIG_ENDIAN_S)
#define I2S_TX_BIG_ENDIAN_V  0x00000001U
#define I2S_TX_BIG_ENDIAN_S  7
/** I2S_TX_UPDATE : R/W/SC; bitpos: [8]; default: 0;
 *  Set 1 to update I2S TX registers from APB clock domain to I2S TX clock domain. This
 *  bit will be cleared by hardware after update register done.
 */
#define I2S_TX_UPDATE    (BIT(8))
#define I2S_TX_UPDATE_M  (I2S_TX_UPDATE_V << I2S_TX_UPDATE_S)
#define I2S_TX_UPDATE_V  0x00000001U
#define I2S_TX_UPDATE_S  8
/** I2S_TX_MONO_FST_VLD : R/W; bitpos: [9]; default: 1;
 *  1: The first channel data value is valid in I2S TX mono mode.   0: The second
 *  channel data value is valid in I2S TX mono mode.
 */
#define I2S_TX_MONO_FST_VLD    (BIT(9))
#define I2S_TX_MONO_FST_VLD_M  (I2S_TX_MONO_FST_VLD_V << I2S_TX_MONO_FST_VLD_S)
#define I2S_TX_MONO_FST_VLD_V  0x00000001U
#define I2S_TX_MONO_FST_VLD_S  9
/** I2S_TX_PCM_CONF : R/W; bitpos: [11:10]; default: 0;
 *  I2S TX compress/decompress configuration bit. & 0 (atol): A-Law decompress, 1
 *  (ltoa) : A-Law compress, 2 (utol) : u-Law decompress, 3 (ltou) : u-Law compress. &
 */
#define I2S_TX_PCM_CONF    0x00000003U
#define I2S_TX_PCM_CONF_M  (I2S_TX_PCM_CONF_V << I2S_TX_PCM_CONF_S)
#define I2S_TX_PCM_CONF_V  0x00000003U
#define I2S_TX_PCM_CONF_S  10
/** I2S_TX_PCM_BYPASS : R/W; bitpos: [12]; default: 1;
 *  Set this bit to bypass  Compress/Decompress module for transmitted data.
 */
#define I2S_TX_PCM_BYPASS    (BIT(12))
#define I2S_TX_PCM_BYPASS_M  (I2S_TX_PCM_BYPASS_V << I2S_TX_PCM_BYPASS_S)
#define I2S_TX_PCM_BYPASS_V  0x00000001U
#define I2S_TX_PCM_BYPASS_S  12
/** I2S_TX_MSB_SHIFT : R/W; bitpos: [13]; default: 1;
 *  Set this bit to enable transmitter in Phillips standard mode
 */
#define I2S_TX_MSB_SHIFT    (BIT(13))
#define I2S_TX_MSB_SHIFT_M  (I2S_TX_MSB_SHIFT_V << I2S_TX_MSB_SHIFT_S)
#define I2S_TX_MSB_SHIFT_V  0x00000001U
#define I2S_TX_MSB_SHIFT_S  13
/** I2S_TX_BCK_NO_DLY : R/W; bitpos: [14]; default: 1;
 *  1: BCK is not delayed to generate pos/neg edge in master mode. 0: BCK is delayed to
 *  generate pos/neg edge in master mode.
 */
#define I2S_TX_BCK_NO_DLY    (BIT(14))
#define I2S_TX_BCK_NO_DLY_M  (I2S_TX_BCK_NO_DLY_V << I2S_TX_BCK_NO_DLY_S)
#define I2S_TX_BCK_NO_DLY_V  0x00000001U
#define I2S_TX_BCK_NO_DLY_S  14
/** I2S_TX_LEFT_ALIGN : R/W; bitpos: [15]; default: 1;
 *  1: I2S TX left alignment mode. 0: I2S TX right alignment mode.
 */
#define I2S_TX_LEFT_ALIGN    (BIT(15))
#define I2S_TX_LEFT_ALIGN_M  (I2S_TX_LEFT_ALIGN_V << I2S_TX_LEFT_ALIGN_S)
#define I2S_TX_LEFT_ALIGN_V  0x00000001U
#define I2S_TX_LEFT_ALIGN_S  15
/** I2S_TX_24_FILL_EN : R/W; bitpos: [16]; default: 0;
 *  1: Sent 32 bits in 24 channel bits mode. 0: Sent 24 bits in 24 channel bits mode
 */
#define I2S_TX_24_FILL_EN    (BIT(16))
#define I2S_TX_24_FILL_EN_M  (I2S_TX_24_FILL_EN_V << I2S_TX_24_FILL_EN_S)
#define I2S_TX_24_FILL_EN_V  0x00000001U
#define I2S_TX_24_FILL_EN_S  16
/** I2S_TX_WS_IDLE_POL : R/W; bitpos: [17]; default: 0;
 *  0: WS should be 0 when sending left channel data, and WS is 1in right channel.  1:
 *  WS should be 1 when sending left channel data, and WS is 0in right channel.
 */
#define I2S_TX_WS_IDLE_POL    (BIT(17))
#define I2S_TX_WS_IDLE_POL_M  (I2S_TX_WS_IDLE_POL_V << I2S_TX_WS_IDLE_POL_S)
#define I2S_TX_WS_IDLE_POL_V  0x00000001U
#define I2S_TX_WS_IDLE_POL_S  17
/** I2S_TX_BIT_ORDER : R/W; bitpos: [18]; default: 0;
 *  I2S Tx bit endian. 1:small endian, the LSB is sent first. 0:big endian, the MSB is
 *  sent first.
 */
#define I2S_TX_BIT_ORDER    (BIT(18))
#define I2S_TX_BIT_ORDER_M  (I2S_TX_BIT_ORDER_V << I2S_TX_BIT_ORDER_S)
#define I2S_TX_BIT_ORDER_V  0x00000001U
#define I2S_TX_BIT_ORDER_S  18
/** I2S_TX_TDM_EN : R/W; bitpos: [19]; default: 0;
 *  1: Enable I2S TDM Tx mode . 0: Disable.
 */
#define I2S_TX_TDM_EN    (BIT(19))
#define I2S_TX_TDM_EN_M  (I2S_TX_TDM_EN_V << I2S_TX_TDM_EN_S)
#define I2S_TX_TDM_EN_V  0x00000001U
#define I2S_TX_TDM_EN_S  19
/** I2S_TX_PDM_EN : R/W; bitpos: [20]; default: 0;
 *  1: Enable I2S PDM Tx mode . 0: Disable.
 */
#define I2S_TX_PDM_EN    (BIT(20))
#define I2S_TX_PDM_EN_M  (I2S_TX_PDM_EN_V << I2S_TX_PDM_EN_S)
#define I2S_TX_PDM_EN_V  0x00000001U
#define I2S_TX_PDM_EN_S  20
/** I2S_TX_BCK_DIV_NUM : R/W; bitpos: [26:21]; default: 6;
 *  Bit clock configuration bits in transmitter mode.
 */
#define I2S_TX_BCK_DIV_NUM    0x0000003FU
#define I2S_TX_BCK_DIV_NUM_M  (I2S_TX_BCK_DIV_NUM_V << I2S_TX_BCK_DIV_NUM_S)
#define I2S_TX_BCK_DIV_NUM_V  0x0000003FU
#define I2S_TX_BCK_DIV_NUM_S  21
/** I2S_TX_CHAN_MOD : R/W; bitpos: [29:27]; default: 0;
 *  I2S transmitter channel mode configuration bits.
 */
#define I2S_TX_CHAN_MOD    0x00000007U
#define I2S_TX_CHAN_MOD_M  (I2S_TX_CHAN_MOD_V << I2S_TX_CHAN_MOD_S)
#define I2S_TX_CHAN_MOD_V  0x00000007U
#define I2S_TX_CHAN_MOD_S  27
/** I2S_SIG_LOOPBACK : R/W; bitpos: [30]; default: 0;
 *  Enable signal loop back mode with transmitter module and receiver module sharing
 *  the same WS and BCK signals.
 */
#define I2S_SIG_LOOPBACK    (BIT(30))
#define I2S_SIG_LOOPBACK_M  (I2S_SIG_LOOPBACK_V << I2S_SIG_LOOPBACK_S)
#define I2S_SIG_LOOPBACK_V  0x00000001U
#define I2S_SIG_LOOPBACK_S  30

/** I2S_RX_CONF1_REG register
 *  I2S RX configure register 1
 */
#define I2S_RX_CONF1_REG(i) (REG_I2S_BASE(i) + 0x28)
/** I2S_RX_TDM_WS_WIDTH : R/W; bitpos: [8:0]; default: 0;
 *  The width of rx_ws_out at idle level in TDM mode is (I2S_RX_TDM_WS_WIDTH[8:0] +1) *
 *  T_bck
 */
#define I2S_RX_TDM_WS_WIDTH    0x000001FFU
#define I2S_RX_TDM_WS_WIDTH_M  (I2S_RX_TDM_WS_WIDTH_V << I2S_RX_TDM_WS_WIDTH_S)
#define I2S_RX_TDM_WS_WIDTH_V  0x000001FFU
#define I2S_RX_TDM_WS_WIDTH_S  0
/** I2S_RX_BITS_MOD : R/W; bitpos: [18:14]; default: 15;
 *  Set the bits to configure the valid data bit length of I2S receiver channel. 7: all
 *  the valid channel data is in 8-bit-mode. 15: all the valid channel data is in
 *  16-bit-mode. 23: all the valid channel data is in 24-bit-mode. 31:all the valid
 *  channel data is in 32-bit-mode.
 */
#define I2S_RX_BITS_MOD    0x0000001FU
#define I2S_RX_BITS_MOD_M  (I2S_RX_BITS_MOD_V << I2S_RX_BITS_MOD_S)
#define I2S_RX_BITS_MOD_V  0x0000001FU
#define I2S_RX_BITS_MOD_S  14
/** I2S_RX_HALF_SAMPLE_BITS : R/W; bitpos: [26:19]; default: 15;
 *  I2S Rx half sample bits -1.
 */
#define I2S_RX_HALF_SAMPLE_BITS    0x000000FFU
#define I2S_RX_HALF_SAMPLE_BITS_M  (I2S_RX_HALF_SAMPLE_BITS_V << I2S_RX_HALF_SAMPLE_BITS_S)
#define I2S_RX_HALF_SAMPLE_BITS_V  0x000000FFU
#define I2S_RX_HALF_SAMPLE_BITS_S  19
/** I2S_RX_TDM_CHAN_BITS : R/W; bitpos: [31:27]; default: 15;
 *  The Rx bit number for each channel minus 1in TDM mode.
 */
#define I2S_RX_TDM_CHAN_BITS    0x0000001FU
#define I2S_RX_TDM_CHAN_BITS_M  (I2S_RX_TDM_CHAN_BITS_V << I2S_RX_TDM_CHAN_BITS_S)
#define I2S_RX_TDM_CHAN_BITS_V  0x0000001FU
#define I2S_RX_TDM_CHAN_BITS_S  27

/** I2S_TX_CONF1_REG register
 *  I2S TX configure register 1
 */
#define I2S_TX_CONF1_REG(i) (REG_I2S_BASE(i) + 0x2c)
/** I2S_TX_TDM_WS_WIDTH : R/W; bitpos: [8:0]; default: 0;
 *  The width of tx_ws_out at idle level in TDM mode is (I2S_TX_TDM_WS_WIDTH[8:0] +1) *
 *  T_bck
 */
#define I2S_TX_TDM_WS_WIDTH    0x000001FFU
#define I2S_TX_TDM_WS_WIDTH_M  (I2S_TX_TDM_WS_WIDTH_V << I2S_TX_TDM_WS_WIDTH_S)
#define I2S_TX_TDM_WS_WIDTH_V  0x000001FFU
#define I2S_TX_TDM_WS_WIDTH_S  0
/** I2S_TX_BITS_MOD : R/W; bitpos: [18:14]; default: 15;
 *  Set the bits to configure the valid data bit length of I2S transmitter channel. 7:
 *  all the valid channel data is in 8-bit-mode. 15: all the valid channel data is in
 *  16-bit-mode. 23: all the valid channel data is in 24-bit-mode. 31:all the valid
 *  channel data is in 32-bit-mode.
 */
#define I2S_TX_BITS_MOD    0x0000001FU
#define I2S_TX_BITS_MOD_M  (I2S_TX_BITS_MOD_V << I2S_TX_BITS_MOD_S)
#define I2S_TX_BITS_MOD_V  0x0000001FU
#define I2S_TX_BITS_MOD_S  14
/** I2S_TX_HALF_SAMPLE_BITS : R/W; bitpos: [26:19]; default: 15;
 *  I2S Tx half sample bits -1.
 */
#define I2S_TX_HALF_SAMPLE_BITS    0x000000FFU
#define I2S_TX_HALF_SAMPLE_BITS_M  (I2S_TX_HALF_SAMPLE_BITS_V << I2S_TX_HALF_SAMPLE_BITS_S)
#define I2S_TX_HALF_SAMPLE_BITS_V  0x000000FFU
#define I2S_TX_HALF_SAMPLE_BITS_S  19
/** I2S_TX_TDM_CHAN_BITS : R/W; bitpos: [31:27]; default: 15;
 *  The Tx bit number for each channel minus 1in TDM mode.
 */
#define I2S_TX_TDM_CHAN_BITS    0x0000001FU
#define I2S_TX_TDM_CHAN_BITS_M  (I2S_TX_TDM_CHAN_BITS_V << I2S_TX_TDM_CHAN_BITS_S)
#define I2S_TX_TDM_CHAN_BITS_V  0x0000001FU
#define I2S_TX_TDM_CHAN_BITS_S  27

