espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/i2s_reg.h
/** I2S_TX_PCM2PDM_CONF_REG register
 *  I2S TX PCM2PDM configuration register
 */
#define I2S_TX_PCM2PDM_CONF_REG(i) (REG_I2S_BASE(i) + 0x40)
/** I2S_TX_PDM_SINC_OSR2 : R/W; bitpos: [4:1]; default: 2;
 *  I2S TX PDM OSR2 value
 */
#define I2S_TX_PDM_SINC_OSR2    0x0000000FU
#define I2S_TX_PDM_SINC_OSR2_M  (I2S_TX_PDM_SINC_OSR2_V << I2S_TX_PDM_SINC_OSR2_S)
#define I2S_TX_PDM_SINC_OSR2_V  0x0000000FU
#define I2S_TX_PDM_SINC_OSR2_S  1
/** I2S_TX_PDM_PRESCALE : R/W; bitpos: [12:5]; default: 0;
 *  I2S TX PDM prescale for sigmadelta
 */
#define I2S_TX_PDM_PRESCALE    0x000000FFU
#define I2S_TX_PDM_PRESCALE_M  (I2S_TX_PDM_PRESCALE_V << I2S_TX_PDM_PRESCALE_S)
#define I2S_TX_PDM_PRESCALE_V  0x000000FFU
#define I2S_TX_PDM_PRESCALE_S  5
/** I2S_TX_PDM_HP_IN_SHIFT : R/W; bitpos: [14:13]; default: 1;
 *  I2S TX PDM sigmadelta scale shift number: 0:/2 , 1:x1 , 2:x2 , 3: x4
 */
#define I2S_TX_PDM_HP_IN_SHIFT    0x00000003U
#define I2S_TX_PDM_HP_IN_SHIFT_M  (I2S_TX_PDM_HP_IN_SHIFT_V << I2S_TX_PDM_HP_IN_SHIFT_S)
#define I2S_TX_PDM_HP_IN_SHIFT_V  0x00000003U
#define I2S_TX_PDM_HP_IN_SHIFT_S  13
/** I2S_TX_PDM_LP_IN_SHIFT : R/W; bitpos: [16:15]; default: 1;
 *  I2S TX PDM sigmadelta scale shift number: 0:/2 , 1:x1 , 2:x2 , 3: x4
 */
#define I2S_TX_PDM_LP_IN_SHIFT    0x00000003U
#define I2S_TX_PDM_LP_IN_SHIFT_M  (I2S_TX_PDM_LP_IN_SHIFT_V << I2S_TX_PDM_LP_IN_SHIFT_S)
#define I2S_TX_PDM_LP_IN_SHIFT_V  0x00000003U
#define I2S_TX_PDM_LP_IN_SHIFT_S  15
/** I2S_TX_PDM_SINC_IN_SHIFT : R/W; bitpos: [18:17]; default: 1;
 *  I2S TX PDM sigmadelta scale shift number: 0:/2 , 1:x1 , 2:x2 , 3: x4
 */
#define I2S_TX_PDM_SINC_IN_SHIFT    0x00000003U
#define I2S_TX_PDM_SINC_IN_SHIFT_M  (I2S_TX_PDM_SINC_IN_SHIFT_V << I2S_TX_PDM_SINC_IN_SHIFT_S)
#define I2S_TX_PDM_SINC_IN_SHIFT_V  0x00000003U
#define I2S_TX_PDM_SINC_IN_SHIFT_S  17
/** I2S_TX_PDM_SIGMADELTA_IN_SHIFT : R/W; bitpos: [20:19]; default: 1;
 *  I2S TX PDM sigmadelta scale shift number: 0:/2 , 1:x1 , 2:x2 , 3: x4
 */
#define I2S_TX_PDM_SIGMADELTA_IN_SHIFT    0x00000003U
#define I2S_TX_PDM_SIGMADELTA_IN_SHIFT_M  (I2S_TX_PDM_SIGMADELTA_IN_SHIFT_V << I2S_TX_PDM_SIGMADELTA_IN_SHIFT_S)
#define I2S_TX_PDM_SIGMADELTA_IN_SHIFT_V  0x00000003U
#define I2S_TX_PDM_SIGMADELTA_IN_SHIFT_S  19
/** I2S_TX_PDM_SIGMADELTA_DITHER2 : R/W; bitpos: [21]; default: 0;
 *  I2S TX PDM sigmadelta dither2 value
 */
#define I2S_TX_PDM_SIGMADELTA_DITHER2    (BIT(21))
#define I2S_TX_PDM_SIGMADELTA_DITHER2_M  (I2S_TX_PDM_SIGMADELTA_DITHER2_V << I2S_TX_PDM_SIGMADELTA_DITHER2_S)
#define I2S_TX_PDM_SIGMADELTA_DITHER2_V  0x00000001U
#define I2S_TX_PDM_SIGMADELTA_DITHER2_S  21
/** I2S_TX_PDM_SIGMADELTA_DITHER : R/W; bitpos: [22]; default: 1;
 *  I2S TX PDM sigmadelta dither value
 */
#define I2S_TX_PDM_SIGMADELTA_DITHER    (BIT(22))
#define I2S_TX_PDM_SIGMADELTA_DITHER_M  (I2S_TX_PDM_SIGMADELTA_DITHER_V << I2S_TX_PDM_SIGMADELTA_DITHER_S)
#define I2S_TX_PDM_SIGMADELTA_DITHER_V  0x00000001U
#define I2S_TX_PDM_SIGMADELTA_DITHER_S  22
/** I2S_TX_PDM_DAC_2OUT_EN : R/W; bitpos: [23]; default: 0;
 *  I2S TX PDM dac mode enable
 */
#define I2S_TX_PDM_DAC_2OUT_EN    (BIT(23))
#define I2S_TX_PDM_DAC_2OUT_EN_M  (I2S_TX_PDM_DAC_2OUT_EN_V << I2S_TX_PDM_DAC_2OUT_EN_S)
#define I2S_TX_PDM_DAC_2OUT_EN_V  0x00000001U
#define I2S_TX_PDM_DAC_2OUT_EN_S  23
/** I2S_TX_PDM_DAC_MODE_EN : R/W; bitpos: [24]; default: 0;
 *  I2S TX PDM dac 2channel enable
 */
#define I2S_TX_PDM_DAC_MODE_EN    (BIT(24))
#define I2S_TX_PDM_DAC_MODE_EN_M  (I2S_TX_PDM_DAC_MODE_EN_V << I2S_TX_PDM_DAC_MODE_EN_S)
#define I2S_TX_PDM_DAC_MODE_EN_V  0x00000001U
#define I2S_TX_PDM_DAC_MODE_EN_S  24
/** I2S_PCM2PDM_CONV_EN : R/W; bitpos: [25]; default: 0;
 *  I2S TX PDM Converter enable
 */
#define I2S_PCM2PDM_CONV_EN    (BIT(25))
#define I2S_PCM2PDM_CONV_EN_M  (I2S_PCM2PDM_CONV_EN_V << I2S_PCM2PDM_CONV_EN_S)
#define I2S_PCM2PDM_CONV_EN_V  0x00000001U
#define I2S_PCM2PDM_CONV_EN_S  25

/** I2S_TX_PCM2PDM_CONF1_REG register
 *  I2S TX PCM2PDM configuration register
 */
#define I2S_TX_PCM2PDM_CONF1_REG(i) (REG_I2S_BASE(i) + 0x44)
/** I2S_TX_PDM_FP : R/W; bitpos: [9:0]; default: 960;
 *  I2S TX PDM Fp
 */
#define I2S_TX_PDM_FP    0x000003FFU
#define I2S_TX_PDM_FP_M  (I2S_TX_PDM_FP_V << I2S_TX_PDM_FP_S)
#define I2S_TX_PDM_FP_V  0x000003FFU
#define I2S_TX_PDM_FP_S  0
/** I2S_TX_PDM_FS : R/W; bitpos: [19:10]; default: 480;
 *  I2S TX PDM Fs
 */
#define I2S_TX_PDM_FS    0x000003FFU
#define I2S_TX_PDM_FS_M  (I2S_TX_PDM_FS_V << I2S_TX_PDM_FS_S)
#define I2S_TX_PDM_FS_V  0x000003FFU
#define I2S_TX_PDM_FS_S  10
/** I2S_TX_IIR_HP_MULT12_5 : R/W; bitpos: [22:20]; default: 7;
 *  The fourth parameter of PDM TX IIR_HP filter stage 2 is (504 +
 *  I2S_TX_IIR_HP_MULT12_5[2:0])
 */
#define I2S_TX_IIR_HP_MULT12_5    0x00000007U
#define I2S_TX_IIR_HP_MULT12_5_M  (I2S_TX_IIR_HP_MULT12_5_V << I2S_TX_IIR_HP_MULT12_5_S)
#define I2S_TX_IIR_HP_MULT12_5_V  0x00000007U
#define I2S_TX_IIR_HP_MULT12_5_S  20
/** I2S_TX_IIR_HP_MULT12_0 : R/W; bitpos: [25:23]; default: 7;
 *  The fourth parameter of PDM TX IIR_HP filter stage 1 is (504 +
 *  I2S_TX_IIR_HP_MULT12_0[2:0])
 */
#define I2S_TX_IIR_HP_MULT12_0    0x00000007U
#define I2S_TX_IIR_HP_MULT12_0_M  (I2S_TX_IIR_HP_MULT12_0_V << I2S_TX_IIR_HP_MULT12_0_S)
#define I2S_TX_IIR_HP_MULT12_0_V  0x00000007U
#define I2S_TX_IIR_HP_MULT12_0_S  23

/** I2S_RX_PDM2PCM_CONF_REG register
 *  I2S RX configure register
 */
#define I2S_RX_PDM2PCM_CONF_REG(i) (REG_I2S_BASE(i) + 0x48)
/** I2S_RX_PDM2PCM_EN : R/W; bitpos: [19]; default: 0;
 *  1: Enable PDM2PCM RX mode. 0: DIsable.
 */
#define I2S_RX_PDM2PCM_EN    (BIT(19))
#define I2S_RX_PDM2PCM_EN_M  (I2S_RX_PDM2PCM_EN_V << I2S_RX_PDM2PCM_EN_S)
#define I2S_RX_PDM2PCM_EN_V  0x00000001U
#define I2S_RX_PDM2PCM_EN_S  19
/** I2S_RX_PDM_SINC_DSR_16_EN : R/W; bitpos: [20]; default: 0;
 *  Configure the down sampling rate of PDM RX filter group1 module. 1: The  down
 *  sampling rate is 128. 0: down sampling rate is 64.
 */
#define I2S_RX_PDM_SINC_DSR_16_EN    (BIT(20))
#define I2S_RX_PDM_SINC_DSR_16_EN_M  (I2S_RX_PDM_SINC_DSR_16_EN_V << I2S_RX_PDM_SINC_DSR_16_EN_S)
#define I2S_RX_PDM_SINC_DSR_16_EN_V  0x00000001U
#define I2S_RX_PDM_SINC_DSR_16_EN_S  20
/** I2S_RX_PDM2PCM_AMPLIFY_NUM : R/W; bitpos: [24:21]; default: 1;
 *  Configure PDM RX amplify number.
 */
#define I2S_RX_PDM2PCM_AMPLIFY_NUM    0x0000000FU
#define I2S_RX_PDM2PCM_AMPLIFY_NUM_M  (I2S_RX_PDM2PCM_AMPLIFY_NUM_V << I2S_RX_PDM2PCM_AMPLIFY_NUM_S)
#define I2S_RX_PDM2PCM_AMPLIFY_NUM_V  0x0000000FU
#define I2S_RX_PDM2PCM_AMPLIFY_NUM_S  21
/** I2S_RX_PDM_HP_BYPASS : R/W; bitpos: [25]; default: 0;
 *  I2S PDM RX bypass hp filter or not.
 */
#define I2S_RX_PDM_HP_BYPASS    (BIT(25))
#define I2S_RX_PDM_HP_BYPASS_M  (I2S_RX_PDM_HP_BYPASS_V << I2S_RX_PDM_HP_BYPASS_S)
#define I2S_RX_PDM_HP_BYPASS_V  0x00000001U
#define I2S_RX_PDM_HP_BYPASS_S  25
/** I2S_RX_IIR_HP_MULT12_5 : R/W; bitpos: [28:26]; default: 6;
 *  The fourth parameter of PDM RX IIR_HP filter stage 2 is (504 +
 *  LP_I2S_RX_IIR_HP_MULT12_5[2:0])
 */
#define I2S_RX_IIR_HP_MULT12_5    0x00000007U
#define I2S_RX_IIR_HP_MULT12_5_M  (I2S_RX_IIR_HP_MULT12_5_V << I2S_RX_IIR_HP_MULT12_5_S)
#define I2S_RX_IIR_HP_MULT12_5_V  0x00000007U
#define I2S_RX_IIR_HP_MULT12_5_S  26
/** I2S_RX_IIR_HP_MULT12_0 : R/W; bitpos: [31:29]; default: 7;
 *  The fourth parameter of PDM RX IIR_HP filter stage 1 is (504 +
 *  LP_I2S_RX_IIR_HP_MULT12_0[2:0])
 */
#define I2S_RX_IIR_HP_MULT12_0    0x00000007U
#define I2S_RX_IIR_HP_MULT12_0_M  (I2S_RX_IIR_HP_MULT12_0_V << I2S_RX_IIR_HP_MULT12_0_S)
#define I2S_RX_IIR_HP_MULT12_0_V  0x00000007U
#define I2S_RX_IIR_HP_MULT12_0_S  29

